## Plan Result (demo_backendappgateway)




<pre><code>Plan: 0 to add, 4 to change, 0 to destroy.</code></pre>

* Update
  * module.backendappgateway.azurerm_application_gateway.ag[0]
  * module.backendappgateway.azurerm_application_gateway.ag[1]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backendappgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw"
    }

  # module.backendappgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw"
        name                              = "cft-aks00-demo-agw"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (7 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/aac-manage-case-assignment" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "aac-manage-case-assignment" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/am-judicial-booking-service" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "am-judicial-booking-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/am-org-role-mapping-service" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "am-org-role-mapping-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/am-role-assignment-service" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "am-role-assignment-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/bar-api" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "bar-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/bulk-scan-orchestrator" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "bulk-scan-orchestrator" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/bulk-scan-payment-processor" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "bulk-scan-payment-processor" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/bulk-scan-processor" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "bulk-scan-processor" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/bulk-scan-sample-app" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "bulk-scan-sample-app" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/camunda-api" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "camunda-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/camunda-optimize" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "camunda-optimize" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/ccd-case-activity-api" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "ccd-case-activity-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/ccd-case-document-am-api" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "ccd-case-document-am-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/ccd-data-store-api" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "ccd-data-store-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/ccd-definition-store-api" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "ccd-definition-store-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/ccd-message-publisher" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "ccd-message-publisher" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/ccd-user-profile-api" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "ccd-user-profile-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/ccpay-bulkscanning-api" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "ccpay-bulkscanning-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/ccpay-refunds-api" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "ccpay-refunds-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/civil-general-applications" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "civil-general-applications" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/civil-orchestrator-service" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "civil-orchestrator-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/civil-service" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "civil-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/cmc-claim-store" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "cmc-claim-store" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/cmc-pdf-service" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "cmc-pdf-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/cpo-case-payment-orders-api" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "cpo-case-payment-orders-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/dg-docassembly" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "dg-docassembly" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/dg-docmosis" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "dg-docmosis" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/div-cfs" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "div-cfs" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/div-cms" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "div-cms" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/div-cos" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "div-cos" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/div-dgs" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "div-dgs" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/div-emca" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "div-emca" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/div-fps" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "div-fps" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/div-hm" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "div-hm" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/dm-store" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "dm-store" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/draft-store-service" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "draft-store-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/em-anno" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "em-anno" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/em-ccd-orchestrator" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "em-ccd-orchestrator" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/em-hrs-api" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/rd-professional-api-int" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "rd-professional-api-int" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/rd-profile-sync" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "rd-profile-sync" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/rd-profile-sync-int" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "rd-profile-sync-int" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/rd-user-profile-api" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "rd-user-profile-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/rd-user-profile-api-int" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "rd-user-profile-api-int" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/rpts-api" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "rpts-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/sptribs-case-api" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "sptribs-case-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/sscs-hearings-api" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "sscs-hearings-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/ts-translation-service" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "ts-translation-service" -> null
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "aac-ac-int-manage-case-assignment"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "adoption-cos-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "bar-api-int"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "camunda-bpm"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "ccd-ac-int-data-store-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "ccd-ac-int-definition-store-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "ccd-admin-ccd-int"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "ccd-admin-web"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "ccd-test-stubs-service"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "ccpay-bulkscanning-api-int"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "ccpay-notifications-service"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "ccpay-notifications-service-int"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "ccpay-refunds-api-int"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "civil-sdt"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "civil-sdt-commissioning"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "civil-sdt-gateway"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "dm-store-ccd-int"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "em-anno-ccd-int"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "et-cos"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "et-hearings-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "et-msg-handler"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "et-sya-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "fees-register-api-int"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "fis-bulk-scan-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "fis-cos-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "fis-hmc-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "fprl-cos"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "hmc-cft-hearing-service"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "hmc-hmi-inbound-adapter"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "hmc-hmi-outbound-adapter"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "idam-hmcts-access"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "idam-testing-support-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "jps-judicial-payment-service"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "lau-case-backend-int"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "lau-idam-backend"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "lau-idam-backend-int"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "payment-api-int"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "pcq-backend-int"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "plum-recipe-backend"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "prl-cos"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "prl-dgs"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "rd-caseworker-ref-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "rd-caseworker-ref-api-int"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "rd-commondata-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "rd-judicial-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "rd-judicial-api-int"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "rd-judicial-data-load"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "rd-location-ref-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "rd-location-ref-api-int"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "rd-professional-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "rd-professional-api-int"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "rd-profile-sync"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "rd-profile-sync-int"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "rd-user-profile-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "rd-user-profile-api-int"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "rpts-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "sptribs-case-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "sscs-hearings-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.95.221",
            ]
          + name         = "ts-translation-service"
        }

        # (246 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1653,"Program":"tfcmt","SHA1":"","Target":"demo_backendappgateway","Vars":{}} -->